//#include<stdio.h>
//
//int main()
//{
//	//功能：解释p*p的区别
//	//结论：p代表指针类型，64位操作系统输出结果为8字节，而*p，*为解引用运算符，表示引用所指数据内容，字节数为所指数据类型的字节数
//	//2022/2/25 10点37分
//	//int arr[5] = {1,2,3,4,5 };
//	//int* p = arr;
//	//int i = sizeof(*p);
//	//int v = sizeof(p);
//	//int m = sizeof(arr);
//	//printf("%d\n", i);//4
//	//printf("%d\n", v);//8
//	//printf("%d\n", m);//20  sizeof + 数组名 ，数组名表示整个数组而非首元素地址
//	
//	//功能：
//	//结论：
//	//2022/2/25 11点03分
//	int a = 10;
//	int* d =&a;
//	printf("%d\n",*d);// 输出结果为10，取了地址，就用解引用操作符
//	int* z =a;
//	printf("%d\n",*z);//无输出
//	int * q = &a;
//	printf("%d\n",q);//输出结果为地址，随机值，
//	int* w = a;
//	printf("%p\n",w);//输出结果为10
//}